{
  "belligerent": {
  "definition": "hostile and aggressive",
  "example": "The principal was prone to belligerent outbursts."
  },
  "exquisite": {
  "definition": "extremely beautiful and, typically, delicate",
  "example": "Treasure's exquisite face shone in the sun."
  },
  "ingenious": {
  "definition": "clever, original, and inventive",
  "example": "an ingenious solution."
  },
  "slut": {
  "definition": "a woman who has many casual sexual partners",
  "example": "he called her a slut."
  },
  "go": {
  "definition": "move from one place to another",
  "example": "I'm going to the store."
  },
  "despise":{
  "definition": "feel contempt or intense dislike for someone or something",
  "example": "John despises the movie a lot."
  },
  "flagrant": {
  "definition": "obviously offensive or scandalous",
  "example": "The flagrant violation of the company's policies led to the employee's termination."
  },
  "naked": {
  "definition": "not wearing any clothes",
  "example": "The streaker ran across the field naked."
  },
  "nakedly": {
    "definition": "in a state of being without clothes",
    "example": "The artist painted a nakedly honest portrait of his subject."
    },
    "nakedness": {
    "definition": "the state of being without clothes",
    "example": "The nakedness of the beachgoers made some people uncomfortable."
    },
    "huge": {
    "definition": "very large in size or amount",
    "example": "The new building was huge, towering over the surrounding buildings."
    },
    "beautiful": {
    "definition": "pleasing to the senses or mind",
    "example": "The sunset was so beautiful that it took my breath away."
    },
    "dimwit": {
    "definition": "a stupid or slow-witted person",
    "example": "The boss called the employee a dimwit for making a mistake."
    },
    "dimwittedness": {
    "definition": "the quality of being stupid or slow-witted",
    "example": "The dimwittedness of the character made the audience laugh."
    },
    "dimwits": {
    "definition": "plural form of 'dimwit', referring to multiple stupid or slow-witted people",
    "example": "The group of dimwits couldn't figure out the puzzle."
    },
    "feeble": {
    "definition": "lacking physical or mental strength",
    "example": "The old man's feeble voice could barely be heard."
    },
    "executed": {
    "definition": "put to death, typically as a legal punishment",
    "example": "The criminal was executed for his heinous crimes."
    },
    "execute": {
    "definition": "carry out or put into effect (a plan, order, or course of action)",
    "example": "The CEO wanted to execute his vision for the company."
    },
    "lopped": {
    "definition": "cut off (a branch, limb, or other protrusion) from the main body of a tree or other plant",
    "example": "The gardener lopped off the dead branches of the tree."
    },
    "lopped off": {
    "definition": "cut off (a part of the body or a protrusion) with a sharp instrument",
    "example": "The thief's hand was lopped off as punishment for his crimes."
    },
    "bulge": {
    "definition": "a rounded swelling or protuberance that distorts a flat surface",
    "example": "The backpack was bulging with books and supplies."
    },
    "bulging": {
    "definition": "swollen or protruding outwards",
    "example": "The athlete's muscles were bulging with strength."
    },
    "bulged": {
    "definition": "swollen or protruded outwards",
    "example": "The veins on the man's forehead bulged with anger."
    },
    "revolt": {
    "definition": "a violent uprising against an authority or government",
    "example": "The peasants staged a revolt against the corrupt king."
    },
    "revolting": {
    "definition": "causing intense disgust or abhorrence",
    "example": "The smell from the garbage can was revolting."
    },
    "revolted": {
    "definition": "feeling disgust or abhorrence",
    "example": "She was revolted by the sight of the dead animal on the road."
    },
    "revoltingly": {
    "definition": "in a manner that causes intense disgust or abhorrence",
    "example": "The bathroom was revoltingly dirty, with mold and grime covering the walls."
  },
    "gurgle": {
    "definition": "make a hollow bubbling sound",
    "example": "The baby gurgled happily in her crib."
},
"gurgled": {
"definition": "made a hollow bubbling sound",
"example": "The stream gurgled as it flowed over the rocks."
},
"gurgling": {
"definition": "making a hollow bubbling sound",
"example": "The pot on the stove was gurgling as it boiled over."
},
"gurgles": {
"definition": "plural form of 'gurgle', referring to multiple hollow bubbling sounds",
"example": "The gurgles of the water fountain were soothing to listen to."
},
"filthy": {
"definition": "covered or smeared with dirt, grime, or other impurities",
"example": "The floor of the abandoned building was filthy with dust and debris."
},
"bully": {
"definition": "a person who habitually seeks to harm or intimidate those whom they perceive as vulnerable",
"example": "The school bully was finally caught and punished for his actions."
},
"decommissioned": {
"definition": "withdrawn from service, typically a military or industrial facility or equipment",
"example": "The decommissioned aircraft carrier was turned into a museum."
},
"devastating": {
"definition": "causing great damage or destruction",
"example": "The devastating hurricane destroyed homes and businesses along the coast."
},
"disproportionate": {
"definition": "too large or too small in comparison to something else",
"example": "The punishment was disproportionate to the crime."
},
"gruesome": {
"definition": "causing horror or disgust",
"example": "The gruesome murder scene made the detective's stomach turn."
},
"hoax": {
"definition": "a humorous or malicious deception",
"example": "The fake news story turned out to be a hoax."
},
"imp": {
"definition": "a mischievous or evil spirit",
"example": "The old folk tales warned of malevolent imps who would steal children away in the night."
},
"unhlate": {
"definition": "not existing or being where it should be",
"example": "The missing documents were unhlate and couldn't be found."
},
"mutilate": {
"definition": "inflict a violent and disfiguring injury on",
"example": "The soldier was mutilated in the explosion, losing both of his legs."
},
"pulverize": {
"definition": "reduce to fine particles",
"example": "The machine pulverized the rocks into dust."
},
"tourniquet": {
"definition": "a device used for stopping the flow of blood through a vein or artery",
"example": "The doctor applied a tourniquet to the patient's arm before administering a vaccine."
},
"persevere":{
  "definition": "to persist steadfastly in pursuit of an undertaking, task, journey, or goal, even if hindered by distraction, difficulty, obstacles, or discouragement",
  "example": "Semilore persevered in his studies and graduated near the top of his class."
},
"perseverence":{
"definition":"continued effort to do or acieve something despite difficulties, failure, or opposition: the action or condition or an instance of persevering: STEADFASTNESS"
},
"corpulent":{
  "definition":"having a large, fat, bulky body.",
  "example":"A corpulent, elegantly dressed opera singer came out and sang, and we knew it was over."
},
"somnolent":{
  "definition": "of a kind likely to induce sleep",
  "example":"Trying to teach somnolent students on a very hot day is quiet an arduous task."
},
"supercilious":{
  "definition": "acting arrogantly superior; cooly and patronizingly haughty",
  "example": "The supercilious art dealer rolled her eyes when we asked if she had anything for under $1,000"
},
"jotter":{
  "definition": "A piece of paper"

}

}